SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32SPIN0280/MM32SPIN0280_Bootloader/Device/MM32SPIN0280/Include/reg_common.h
////////////////////////////////////////////////////////////////////////////////
/// @file     reg_common.h
/// @author   AE TEAM
/// @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
///           MM32 FIRMWARE LIBRARY.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

// Define to prevent recursive inclusion

#ifndef __REG_COMMON_H
#define __REG_COMMON_H

// Files includes
#include <stdint.h>
#include <stdbool.h>
#include "types.h"

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
// anonymous unions are enabled by default
#else
#warning Not supported compiler type
#endif

#ifdef INCLUDE_MM32_USER_DEFINE_FILE
//  Include the mm32 user defines in mm32_user_define.h.
//  The defines in this file may alternately be defined on the compiler/link
//  command line or KEIL&IAR preprocessor define symbols -- INCLUDE_MM32_USER_DEFINE_FILE
#include "mm32_user_define.h"
#endif

#ifndef HSE_VALUE
#define HSE_VALUE                       (8000000U)                              ///< Value of the External High oscillator in Hz.
#endif

#ifndef HSE_STARTUP_TIMEOUT
#define HSE_STARTUP_TIMEOUT             (0x8000U)                               ///< Time out for HSE start up.
#endif

#ifndef HSI_PLLSRC_VALUE
#define HSI_PLLSRC_VALUE                (8000000U)                              ///< Value of the PLL Source Frequence in Hz.
#endif
#define HSI_VALUE_PLL_ON                HSI_PLLSRC_VALUE

#ifndef HSI_SYSCLKSRC_VALUE
#define HSI_SYSCLKSRC_VALUE             (8000000U)                              ///< Value of the High Internal oscillator in Hz.
//legacy define
#ifndef HSI_VALUE
#define HSI_VALUE                       HSI_SYSCLKSRC_VALUE
#endif
#endif

#ifndef LSI_VALUE
#define LSI_VALUE                       (40000U)                                ///< Value of the Low Internal oscillator in Hz.
#endif

#define __MPU_PRESENT                   (0)                                     ///< Cortex-M0 does not provide a MPU present or not
#ifndef __NVIC_PRIO_BITS
#define __NVIC_PRIO_BITS                (2)                                     ///< Cortex-M0 uses 2 Bits for the Priority Levels
//#warning "__NVIC_PRIO_BITS not defined in device header file; using default!"
#endif
#define __Vendor_SysTickConfig          (0)                                     ///< Set to 1 if different SysTick Config is used

////////////////////////////////////////////////////////////////////////////////
/// @brief  MM32 MCU Interrupt Handle
////////////////////////////////////////////////////////////////////////////////
typedef enum IRQn {

    NonMaskableInt_IRQn                 = -14,                                  ///< 2 Non Maskable Interrupt
    HardFault_IRQn                      = -13,                                  ///< 3 Cortex-M0 Hard Fault Interrupt
    SVC_IRQn                            = -5,                                   ///< 11 Cortex-M0 SV Call Interrupt
    DebugMonitor_IRQn                   = -4,                                   ///< 12 Cortex-M0 Debug Monitor Interrupt
    PendSV_IRQn                         = -2,                                   ///< 14 Cortex-M0 Pend SV Interrupt
    SysTick_IRQn                        = -1,                                   ///< 15 Cortex-M0 System Tick Interrupt

    WWDG_IWDG_IRQn                      = 0,                                    ///< WatchDog Interrupt
    WWDG_IRQn                           = 0,                                    ///< Window WatchDog Interrupt
    PVD_IRQn                            = 1,                                    ///< PVD through EXTI Line detect Interrupt
    PWMCTRL_IRQn                        = 2,                                    ///< PWM Interrupt
    FLASH_IRQn                          = 3,                                    ///< FLASH Interrupt
    RCC_CRS_IRQn                        = 4,                                    ///< RCC & CRS Interrupt
    RCC_IRQn                            = 4,                                    ///< RCC Interrupt
    EXTI0_1_IRQn                        = 5,                                    ///< EXTI Line 0 and 1 Interrupts
    EXTI2_3_IRQn                        = 6,                                    ///< EXTI Line 2 and 3 Interrupts
    EXTI4_15_IRQn                       = 7,                                    ///< EXTI Line 4 to 15 Interrupts
    HWDIV_IRQn                          = 8,                                    ///< HWDIV Global Interrupt
    DMA1_Channel1_IRQn                  = 9,                                    ///< DMA1 Channel 1 Interrupt
    DMA1_Channel2_3_IRQn                = 10,                                   ///< DMA1 Channel 2 and Channel 3 Interrupts
    DMA1_Channel4_5_IRQn                = 11,                                   ///< DMA1 Channel 4 and Channel 5 Interrupts
    ADC_IRQn                            = 12,                                   ///< ADC Interrupts
    ADC1_IRQn                           = 12,                                   ///< ADC1 Interrupts
    TIM1_BRK_UP_TRG_COM_IRQn            = 13,                                   ///< TIM1 Break, Update, Trigger and Commutation Interrupts
    TIM1_CC_IRQn                        = 14,                                   ///< TIM1 Capture Compare Interrupt
    TIM2_IRQn                           = 15,                                   ///< TIM2 Interrupt
    TIM3_IRQn                           = 16,                                   ///< TIM3 Interrupt
    TIM8_BRK_UP_TRG_COM_IRQn            = 17,                                   ///< TIM8 Break, Update, Trigger and Commutation Interrupts
    TIM8_CC_IRQn                        = 18,                                   ///< TIM8_CC Interrupt
    TIM14_IRQn                          = 19,                                   ///< TIM14 Interrupt
    ADC2_IRQn                           = 20,                                   ///< ADC2 Interrupt
    TIM16_IRQn                          = 21,                                   ///< TIM16 Interrupt
    TIM17_IRQn                          = 22,                                   ///< TIM17 Interrupt
    I2C1_IRQn                           = 23,                                   ///< I2C1 Interrupt
    COMP1_2_3_4_5_IRQn                  = 24,                                   ///< Comparator global interrupt (with EXTI19 23 combine it all toghther)
    SPI1_IRQn                           = 25,                                   ///< SPI1 Interrupt
    SPI2_IRQn                           = 26,                                   ///< SPI1 Interrupt
    UART1_IRQn                          = 27,                                   ///< UART1 Interrupt
    UART2_IRQn                          = 28,                                   ///< UART2 Interrupt
    CSM_IRQn                            = 29,                                   ///< CSM Interrupt
    UART3_IRQn                          = 30,                                   ///< UART3 Interrupt
} IRQn_Type;

